[
  {
    "region": "Unknown",
    "country": "Iran",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe\nprimary risk\nis a misident by Iranian air defence systems. Iran has shown willingness to use long-range, advanced anti-aircraft-capable weapons during heightened tensions and in close proximity to heavily flown international air routes (for example: the shoot-down of Ukraine Int Airlines flight 752 over Tehran). Several countries have issued airspace warnings for Iran - the US continues to ban N-reg aircraft from the airspace. Most operators have been avoiding Iran and Israel since the Oct 2024 rocket attacks between the two countries — most Middle East transits have been operating south via Egypt/Saudi instead.\nMajor events:\nJune 2025: Israel/Iran missile attacks.\nOct 2024: Iranian rocket attack on Israel, and Israeli rocket attack on Iran in response.\nApr 2024: Israel rocket attack on Iran. Iran temporarily closed the western part of the FIR.\nFeb 2024: Report of GPS spoofing on airway M701 from ENEDA to NAGRO - the closest airway to Iraqi airspace. One GPS showed no position and the remaining GPS and all 3 IRS showed radically different positions.\nJan 2024: Pakistan launched retaliatory air strikes into southeastern Iran, after Iran carried out strikes in Pakistan the previous day.\nSep 2023: Several reports of GPS spoofing in northern Iraq, plus some in northern Iran.\nJul 2023: Four countries took Iran to the UN court over the the shootdown of UIA flight 752 over Tehran in Jan 2020. Part of their allegations were that Iran has still not provided sufficient evidence that measures are now in place to prevent this kind of incident from happening again.\nJan 2020: Iranian Armed Forces shot-down Ukraine Int Airlines flight 752 over Tehran, having mistaken the aircraft radar return for an inbound missile. Just hours prior to the shoot-down, the US FAA issued “Emergency Order” Notams banning all US operators from overflying the airspace of Iraq and Iran. This was in response to an Iranian missile strike on US military bases in Iraq, which had occurred earlier that night.\nJune 2019: Iran shot down a US military unmanned aircraft operating in airspace over the Gulf of Oman with a SAM system.\nSince 2017: Iran has conducted multiple ballistic missile test launches without issuing any Notams to warn civil operators, the latest taking place in late Dec 2019.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372024"
  },
  {
    "region": "Unknown",
    "country": "Israel",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe\nprimary risk\nis from short-notice airspace closures due to Iran/Israel airstrikes if the conflict resumes, but also due to ongoing threat of rocket and missile attacks from Hamas in Gaza and Hezbollah in Lebanon. Most operators have been avoiding Iran and Israel since the Oct 2024 rocket attacks between the two countries - most Middle East transits have been operating south via Egypt/Saudi instead. There remains a significant risk within the LLLL/Tel Aviv FIR from the ongoing situation. Most foreign airlines are now avoiding LLBG/Tel Aviv airport.\nThe\nsecondary risk\nis a multitude of factors from operating in a conflict zone: misidentification, debris from air defences, GPS spoofing, false EGPWS alerts (now common in Israeli airspace), and reduced route and diversion options in the event of an aircraft emergency.\nMajor Events:\nJune 2025: Israel/Iran missile attacks.\nOct 2024: Iranian rocket attack on Israel, and Israeli rocket attack on Iran in response.\nSep 2024: EASA issued new CZIB recommending against flights in airspace of Israel (CZIB withdrawn on 31 Jan 2025).\nApr 2024: Iran launched a series of missiles at Israel.\nOct 2023: Major offensive against Hamas launched by Israel, conflict ongoing.\nAug 2021: Following an Israeli airstrike on Syria, Syria sent a surface to air missile towards Tel Aviv. The missile detonated off the coast of Israel and there was no damage.\nMay 2021: LLBG/Tel Aviv Airport was forced to close on several occasions, as air defence systems were activated around the country to repel incoming rocket attacks.\nJuly 2014: Major rocket fire from Gaza against Tel Aviv during the Gaza War. The US FAA responded by imposing restrictions at LLBG/Tel Aviv airport for a two day period, and EASA advised that operators suspend flights, which ultimately resulted in 30 airlines cancelling flights.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Lebanon",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe\nprimary risk\nis from short-notice airspace closures due to Iran/Israel airstrikes if the conflict resumes. Lebanon also has a high risk of GPS spoofing. Though a ceasefire between Hezbollah and Israel has held since Nov 2024, most foreign airlines still avoiding OLBA/Beirut. Several countries have long-standing advisories for Lebanon (the OLBB/Beirut FIR) warning to avoid the airspace.\nMajor events\n:\nOct 2024: Israel launched a ground operation against Hezbollah in southern Lebanon.\nSep 2024: EASA recommends against flights in airspace of Israel and Lebanon.\nNov 2023 - ongoing: GPS spoofing reported in the OLBB/Beirut FIR.\nFeb 2020: An A320 en-route OSDI/Damascus caught in crossfire during attack by 4 Israeli F-16’s, forced to divert to Russian controlled air base.\nSep 2018: Russian IL-20 shot down in error on FIR boundary with Cyprus (Nicosia FIR) - airline flights on UL620 within 50nm of this position.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Syria",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe\nprimary risk\nis from short-notice airspace closures due to Iran/Israel airstrikes if the conflict resumes.\nFollowing the fall of the Assad regime in Dec 2024 and the temporary closure of Syrian airspace, the OSTT/Damascus FIR reopened in Jan 2025. Although the long-running civil war (2011–2024) has officially ended, the airspace remains high-risk. Israeli airstrikes in Syria have continued regularly, targeting Iranian and Hezbollah-linked positions. These strikes pose an enduring threat to civil aviation - aircraft may be misidentified or caught in crossfire.\nOperators should also be aware of potential risks on overwater routes east of Cyprus, particularly where military activity may extend into adjacent airspace.\nTotal flight ban for US, Canadian and German operators, and several other countries have long-standing warnings to avoid the airspace of Syria.\nMajor events\n:\nDec 2024: All Syrian airspace temporarily closed following the rebel take-over of the country.\nOct 2023: OSDI/Damascus and OSAP/Aleppo airports were targeted again by airstrikes. OSDI closed temporarily due to runway damage.\nFeb 2020: An A320 enroute OSDI/Damascus caught in crossfire during attack by 4 Israeli F-16’s, forced to divert to Russian controlled air base.\nSep 2018: Russian IL-20 shot down in error on FIR boundary with Cyprus (Nicosia FIR) - airline flights on UL620 within 50nm of this position.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Russia",
    "alert": "As of June 2025, drone attacks across Russia are ramping up, with some reaching as far as Siberia, and that’s increasing the risk for any aircraft still using Russian airspace. Hundreds of drones have been shot down recently, including in areas around Moscow. Russian air defense systems are using surface-to-air missiles capable of reaching all altitudes, so the risk applies at every level.\nWhile most operators avoid Russian airspace completely, those still flying there for overflights or trips to Russian cities should be prepared for sudden closures or reroutes. Most of this activity happens at night, but daytime disruptions are now common too.\nUkraine's airspace has remained fully closed to civil aviation since the Russian invasion in Feb 2022. On the Russian side, large parts of airspace near the border have also remained restricted. Several countries continue to prohibit their operators from using Russian airspace near the FIR boundaries with Ukraine, due to the persistent risk posed by the conflict.\nThe\nprimary risk\nis an unintended targeting of civil aircraft by military near the Russia-Ukraine border, including misidentification (as with MAS17, UIA752).\nMajor events:\nJan 2025: EASA issued a new CZIB recommending against flights in Western Russia (anywhere west of 60 deg E) due to the threat of anti-aircraft fire. There is a high-danger of misidentification by air defence systems targeting Ukrainian drones and missiles. This follows the shoot down of a passenger jet at URMG/Grozny on Dec 25.\nJan 2024: Crash of military transport aircraft in Russian airspace near Belgarod, approx 20nm from the Ukrainian border. Both Russia and Ukraine accused each other of shooting it down.\nAug 2023: The private jet carrying Wagner mercenary chief Yevgeny Prigozhin crashed en route from Moscow to St Petersburg on Aug 23. Speculation that the crash was due to a bomb onboard.\nJuly 2023 - ongoing: Several incidents of drone strikes on targets in Moscow and surrounding region. Not all of these are repelled by Russian air defences, with some drones damaging buildings, and Moscow airports being forced to close temporarily on many occasions. These types of events are becoming more frequent inside Russian airspace - air defence activity can put civil aircraft at extra risk.\nRead:\nOPSGROUP article: Ukraine and Russia Update March 2022",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Sudan",
    "alert": "Following a military coup in April 2023, Sudan remains closed to all civilian flights. In South Sudan, air navigation services remain suspended above FL245. There is ongoing fighting in Sudan between government and militant forces. HSSK/Khartoum airport is closed, but no Notams are being issued. There is a\nContingency Plan\navailable with published routes for ops in and out of HSPN/Port Sudan airport. For overflights avoiding Sudan, there are some north-south routes available via Egypt and Saudi, and some east-west contingency routes available over South Sudan. If routing via nearby airspace, be aware of other active warnings in close proximity.\nSeveral countries have issued airspace warning advising their operators not to enter the airspace of Sudan, due to risks from anti-aircraft weaponry and military activity. Germany has prohibited its operators from the HSSS/Khartoum FIR.\nRead:\nOPSGROUP article: Sudan Airspace Update, Apr 2023\nThe\nprimary risk\nnow relates to security on the ground for any unplanned diversions to airports in Sudan. Throughout the conflict, there have been reports of passenger jets being targeted by gunfire at HSSK/Khartoum Airport.\nThe\nsecondary risk\nrelates to Sudan’s proximity to\nSouth Sudan\n- which has poor levels of ATC provision for overflights below FL245.\nMajor events\n:\nMay 2025: Drone attack targeting critical infrastructure including HSPN/Port Sudan airport.\nOct 2024: Foreign-registered cargo aircraft was shot down by local militia over North Darfur (Western Sudan, near the border with Chad).\nApr 2023: Military coup on Apr 15. Sudan’s airspace closed, South Sudan’s airspace closed above FL245.\nOct 2021: Military coup on Oct 25. HSSK/Khartoum airport closed for two days, with all flights suspended.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Yemen",
    "alert": "Yemen remains an active conflict zone, and the vast majority of Yemeni airspace (OYSC/Sanaa FIR) should be avoided. Several countries prohibit aircraft from overflying any land portion of the FIR. US operators can still use offshore routes UT702 and M999, while other countries permit flights on overwater portions of Yemeni airspace. Saudi airspace to the north and Somali airspace to the South also have risks.\nThe\nprimary risk\nis intentional targeting by terrorist groups with access to sophisticated anti-aircraft weaponry. Civil aircraft may also be at danger from on-going high intensity military operations including the use of explosive drones and missiles. Saudi and Israeli airstrikes can occur at any time, including in the capital Sana’a.\nMajor events:\nDec 2024 - May 2025: OYSN/Sanaa Airport closed due to damage from Israeli airstrikes in Dec 2024 and May 2025.\nJan 2024: US and UK carried out airstrikes against Houthi rebels in Yemen, in response to recent missile and drone attacks in the Red Sea.\nSep 2023: Houthi drone attacks near the Yemen-Saudi border.\nApr-Oct 2022: All parties in the Yemeni conflict agree a ceasefire.\n2018-2022: Frequent Saudi airstrikes on Sanaa and other targets in Yemen in retaliation for Houthi drone attacks across the border.\n2017: OYSN/Sanaa Airport badly damaged by coalition airstrikes.\nRead:\nSaudi-Yemen Airspace Update, Oct 2020 (OPSGROUP article)",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Haiti",
    "alert": "On Nov 11, two aircraft were hit by gunfire on approach to MTPP/Port-au-Prince. The first, a Spirit A320 enroute from KFLL, was hit on short final to Runway 28 at around 1100 local. Damage was significant, with multiple rounds entering the fuselage, avionics bay, engine, and cabin. The second aircraft, a Jet Blue A320, discovered a bullet hole on return to KJFK.\nOperations at MTPP have been suspended for now, but with this level of risk to aircraft, Haiti will be off-limits for some time to come. The FAA has since banned US operators from flights in the airspace of Haiti below 10,000ft MSL, and several other countries have issued similar warnings. SafeAirspace.net now puts Haiti at Level 1 - Do Not Fly.\nMTPP/Port-au-Prince was previously closed from March-May 2024 due to sustained gang violence across Haiti. Aviation came under direct threat during the worst of the violence, with several reports of several armed attacks at the airport. A new government has since been formed, but gangs still control much of the capital, and the US still advises against all travel to the country. For flights, crew security cannot be guaranteed.\nRead:\nHaiti Crisis: Airport Attacked, Aircraft Shot, March 2024 (OPSGROUP article)",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Libya",
    "alert": "A civil war has been ongoing since 2014. Some progress made in Oct 2020 with the formation of a new government, but Libya remains an active conflict zone with armed clashes between various rival militia groups across the country. There is a high risk to civil aircraft. Libyan airspace (HLLL/Tripoli FIR) should be avoided entirely. Essentially a total flight ban for US and UK operators, and several other countries have warnings in place.\nThe\nprimary risk\nis a misident by Libyan air defense systems, or by militia who have threatened to shoot down aircraft operating in western Libya, including HLLM/Tripoli Mitiga airport. Military activity reported over the high-seas which is either operating as OAT or not in control with ATC. Risk remains high across Libya at all flight levels, and avoidance of all airspace and airports is strongly recommended.\nThe\nsecondary risk\nis that reliable ATC services cannot be guaranteed. The past few years have seen regular ATS and radar outages across the HLLL FIR airspace, and severe limitations in VHF capability, with operators having to communicate with Malta ATC for guidance.\nRead:\nLibya Airspace Update, Feb 2024 (OPSGROUP article)\nMajor events:\nAugust 2023: Major evacuation of aircraft from Tripoli due to violent clashes and gunfire at Mitiga airport.\nRead:\nTripoli mass evacuation of aircraft (OPSGROUP article)\nJuly 2023: Italy cancelled its 10-year ban on flights to/from Libya. Aircraft are no longer banned from Italian airports and airspace if they want to fly from Libya.\nAug 2022: Militia air defense forces claimed to have shot down a US drone operating in the vicinity of Benghazi during a period of increased tensions and threats of renewed violence between competing militias vying for control of Tripoli.\nJune 2022: Failed attempt by militia to enter Tripoli to seize control of government offices, resulting in armed clashes and suspension of flights at HLLM/Mitiga airport.\nJan 2020: Multiple airstrikes targeting HLLM/Mitiga airport. Videos on social media showing planes landing at the airport as shells are falling in the background.\nNov 2019: Militia advancing on the capital, Tripoli, declared a no-fly-zone around the city, threatening to shoot-down civil aircraft attempting to fly to HLLM/Mitiga airport.\n2014: HLLT/Tripoli airport closed after clashes between rival militias destroyed most of the airport's facilities. The airport remains closed to this day; most flights operate out of HLLM/Mitiga airport.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Ukraine",
    "alert": "Ukraine closed its entire airspace to all civil traffic on Feb 24, 2022, due to a military invasion by Russia. There is an ongoing active conflict in Ukraine between Russian and Ukrainian forces. Russia, Belarus and Moldova have closed large sections of their own airspace near to their FIR boundaries with Ukraine.\nAll the major countries who regularly issue airspace warnings (the US, UK, Canada, France, Germany, Italy) have since issued total flight bans for Ukraine due to risk from military activity at all levels. (Several other countries have also issued flight bans for Ukraine but we have not listed them all here due to sheer volume).\nThe\nprimary risk\nis an unintended targeting of civil aircraft by military, including misidentification (as with MAS17, UIA752), or confusion.\nThe\nsecondary risk\nis potential lack of Ukrainian Air Traffic Control Service at short notice (Cyber Attack), and other unforeseeable non-normal operating environments for civil aircraft.\nRead:\nOPSGROUP article: Ukraine and Russia Update March 2022\nPrior to February 2022, there were two areas of concern in Ukraine - the conflict in the far east of the country (affecting UKDV/Dnipro FIR) and the double claim over ATC and airspace in Crimea (UKFV/URFV/Simferopol FIR).",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Iraq",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nEven aside from these recent events, there are high risks to civil aircraft in Iraq. Iraqi airspace (ORBB/Baghdad FIR) should be avoided entirely, except for specific routes and altitudes. Several countries have long-standing airspace warnings advising against operating in Iraqi airspace at the lower flight levels.\nThe\nprimary risk\nis intentional targeting by terrorist organisations who possess portable anti-aircraft weaponry. Civil aircraft may also be misidentified by the air defence systems of both local and foreign military who are active in the country. Drone attacks from Turkey and Iran are common in northern Iraq, which could place civil aircraft at risk - especially at ORSU and ORER airports. Airspace warnings issued by foreign aviation authorities allow for overflights at the higher flight levels (and eastern airways UM860 and UM688 are heavily flown international air routes), but there is a clear risk to civil aircraft operating throughout the FIR at all levels. There also remains a risk from short-notice airspace closures due to Iran/Israel airstrikes if the conflict resumes.\nThe\nsecondary risk\nis from GPS spoofing. Since Sep 2023, OPSGROUP has received several reports of enroute aircraft being targeted with fake GPS signals, leading to complete nav failures.\nMajor events:\nJune 2025: Airspace closed following Israeli missile attack on Iran. Missiles and drones may transit Iraqi airspace.\nApr 2024: Airspace closed due to Iran drone/missile strike on Israel.\nSep 2023: Several reports of GPS spoofing in northern Iraq.\nApr 2023: Several instances of drone and missile attacks in northern Iraq, launched from Turkey and Iran. ORSU and ORER airports targeted several times. Turkey closed its airspace to any flight operating to or from ORSU over security concerns.\nOct 2021: US operators can now overfly the ORBB/Baghdad FIR above FL320. KICZ Notam A0036/20 which banned flights at all levels has been cancelled, and the SFAR now applies.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Saudi Arabia",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe primary risk\nis from spillover from the Israel/Iran conflict in the north of the country; and from Houthi drone and missile attacks on Israel, shipping in the Red Zea, and prior attempts on airports across the country (OERK/Riyadh and OEJN/Jeddah airports have been targeted in the past) but particularly near the border with Yemen.\nPrior to the June 2025 conflict between Israel and Iran, several countries already had airspace warnings in place for Saudi Arabia. Since 2023, risks to aircraft operating over the Sinai Peninsula and the Red Sea have increased due to the conflict in Israel/Gaza. There have been several incidents of missiles and drones launched from Yemen targeting Israel. Some have been shot down over the Red Sea, others have landed on the Egypt/Israel border. A missile intercept incident near Jeddah in Nov 2024 (observed at close proximity by transiting air crew) highlighted the risk to civil aviation, and made it clear that this area is an extension of the Israeli conflict. Many Europe-Asia Middle East routes fly over this area. A\nSpecial Briefing\non this risk is available in your members Dashboard (Special Briefings, Red Sea Conflict Zone).\nAlso be aware of ESCAT procedures if entering the OEJD/Jeddah FIR – you can find those\nhere.\nMajor events:\nJune 2025: EASA issues CZIB warning of spillover risk in the airspace of Egypt and Saudi Arabia from the conflict between Israel and Iran.\nNov 2024: Missile intercept in close proximity to transiting aircraft near Jeddah.\nOct 2023: Cruise missiles and drones launched from Yemen targeting Israel. Some shot down over the Red Sea, others landing on Egypt/Israel border.\nSep 2023: Houthi drone attacks near the Yemen-Saudi border.\nApr-Oct 2022: All parties in the Yemeni conflict agree a ceasefire.\n2020-2022: Frequent Houthi drone and rocket attacks targeting OEAH/Abha and OEGN/Jizan airports along the Yemeni-Saudi Border.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Pakistan",
    "alert": "The\nprimary risk\nin Pakistan’s airspace (the OPKR/Karachi and OPLR/Lahore FIRs) is from military activity by Pakistan and India in the disputed Kashmir region, which poses a potential inadvertent risk to aviation at all altitudes, particularly in the OPLR/Lahore FIR.\nThere was a period of intense shelling and aerial incursions from both sides from 7-10 May 2025. A ceasefire announced on May 10 appears to be holding. We continue to advise caution in the Kashmir region where air defense activity could resume with little warning if hostilities were to restart. If this were to happen, there is a chance that Pakistan could impose a full airspace closure,\nas they did from Feb to Aug 2019\nunder similar circumstances.\nFlight tracking indicates that some operators have resumed overflights of this region, although most are still avoiding the area, opting instead to reroute south via the Gulf of Oman and the UAE.\nSince the events of May 2025, the only country to have issued a new airspace warning to avoid the Kashmir area is France. Several other countries have older airspace warnings in place for Pakistan which advise against overflights at the lower levels.\nMajor events\n:\nMay 2025: Ceasefire on May 10 following four days of conflict in Kashmir region. Most operators still avoiding the region and routing via Gulf of Oman and UAE.\nJan 2024: Iran used ballistic missiles and drones to attack a militant group in western Pakistan.\nDec 2023 - ongoing: First crew reports start two emerge of GPS spoofing around OPLA/Lahore airport.\nFeb-Aug 2019: Pakistan closed its airspace to overflights, following escalating clashes with India in the disputed Kashmir region, with numerous airstrikes on both sides.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Mali",
    "alert": "The northern Mali War has been ongoing since 2012, and there have been no improvements in stability. Several countries have airspace warnings in place, advising to operate FL250/260 or higher, and avoiding GATB, GAGO, and GAKL airports. The US advise caution in Mali's airspace at all levels due to ongoing fighting, militant activity, and foreign private military presence with advanced air defense systems.\nThe\nprimary risk\nis from indirect mortar and rocket fire, including MANPADS, which could target aircraft at low altitudes and at airports.\nMajor events\n:\nSep 2024: Insurgents broke into the airport and set the presidential jet alight. Several other locations were targeted across the city, and the airport temporarily closed following the terrorist attacks - the first in years to hit Bamako.\nDec 2023: German operators are now prohibited from the northern part of Mali below FL260. Fighting by militants is escalating here. Commercial flights to GATB/Tombouctou were cancelled after shelling near the airport in Sep 2023. A military jet also crashed near GAGO/Gao on the same day - there were unconfirmed reports it was shot down.\nAug 2020: All airports across the country were closed from Aug 19-20 following a military coup which overthrew the government. Bamako ACC remained operational throughout, with overflights unaffected.\nApril 2018: Militants attacked UN peacekeepers at two bases near GATB/Timbuktu Airport using both indirect fire weapons and vehicle-borne improvised explosive devices.\nJan 2017 and Nov 2016: Militants conducted vehicle-borne improvised explosive attacks against GAGO/Gao Airport, and rocket attacks against GATB/Timbuktu Airport.\nSenegal and Niger control the airspace over Mali, and they have long-standing Notams (published under the GOOO/Dakar and DRRR/Niamey FIRs) warning that you can only fly at FL320 and above through the entire airspace in Mali north of the GABS/Bamako TMA, due to military ops across the region. More info can be found in this ASECNA\nAIP SUP.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Afghanistan",
    "alert": "US and allied forces pulled out of Afghanistan in Aug 2021, and the Taliban took control of the country. Afghanistan’s airspace now has no ATC service - the OAKX/Kabul FIR is uncontrolled Class G airspace, and overflying traffic should route around the country.\nSome countries say that overflights should only be on airways P500 and G500 in the far east of the OAKX/Kabul FIR, whereas others allow overflights across the entire airspace at and above FL320. Overflights must be on specific\ncontingency routes.\nThe\nprimary risk\nis from surface-to-air fire targeting aircraft operating at low altitudes. Additionally, there is no ATC service across the country's airspace and an extreme threat to aircraft and crew safety and security on the ground.\nMajor events\n:\nAug 2021: US and allied military evacuations have finished at OAKB/Kabul airport. It is now under Taliban control. The FAA advises that there are no longer any ATC services available here, along with the entire OAKX/Kabul FIR.\nRead:\nOpsGroup Note - Afghanistan Ops Update and Situation Overview July 2024",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.372990"
  },
  {
    "region": "Unknown",
    "country": "Somalia",
    "alert": "The situation on the ground is highly unstable and there is an inherent risk to civilians and aircraft. The central government has little control of the major cities and ports, with ongoing attacks from extremist militants targeting civilians who continue to show an intent to target aviation interests.\nThe\nprimary risk\nis to overflying aircraft at the lower flight levels, which may be targeted by anti-aircraft-capable weapons. The US prohibits flights across Somalia’s airspace (the HCSM/Mogadishu FIR) below FL260 except for flights transiting the overwater portion of the airspace going to/from HDAM/Djibouti airport across the border in Ethiopia. Several other countries have issued airspace warnings advising against operating below FL260.\nThe\nsecondary risk\nis from aircraft transiting Somalia being contacted by unauthorized ATC units, who have been issuing climb/descent instructions that conflict with the official ones issued by Mogadishu Control.\nMajor events\n:\nFeb 2024: OPSGROUP received several reports of aircraft within the Mogadishu FIR being contacted by a ‘fake controller’ on the same frequency, issuing conflicting instructions. More info\nhere.\nAug 2023: Reports of uncontrolled operations including combat helicopters flying at low levels (FL030) not reporting position, altitude or routing,\nOct 2022: The Somalian government issued a\nwarning\nthat HCMM/Mogadishu airport may be targeted by militant groups amid the escalating conflict in the country.\nMay 2022: Class A airspace implemented in the HCSM/Mogadishu FIR above FL245. More info\nhere.\n2020-ongoing: Multiple instances of Al-Shabaab attacks on HCMM/Mogadishu and nearby targets, including a UN compound.\nMay 2020: An Embraer EMB-120 was\nshot down while on approach to Bardale airstrip\n, killing all six people on board - an accidental shoot-down by Ethiopian forces stationed in the region to combat Al-Shabaab.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Ethiopia",
    "alert": "Improving airspace risk picture in Ethiopia’s northern Tigray region (the Ethiopia/Eritrea border) since a peace deal was agreed to end the conflict in early Nov 2022. Airspace warnings remain in place though - several states say to avoid the area.\nThe\nprimary risk\nto aviation is from any large-scale ceasefire violations involving missiles or anti-aircraft weaponry, which may present a risk to overflights in the region - civil aircraft being mistaken for something of military interest, or simply caught in the crossfire.\nRead:\nEthiopia Airspace Update, July 2022 (OPSGROUP article)\nMajor Events:\nFeb 2024: New flare-up in fighting in the Amhara region (south of Tigray region), including air strikes.\nNov 2022: Peace deal agreed in the Tigray region. Ethiopian Airlines is planning to resume flights to HAMK/Mekele airport.\nNov 2021: Several western countries issued airspace warnings, as well as “do not travel” travel warnings for the Tigray region following increased fighting there.\nJuly 2021: HAAA/Addis FIR published a Notam closing a section of airspace below FL290 over the Tigray. This followed reports that militia shot down a military transport plane in the region the previous week, near the capital Mekele.\nNov 2020: Major escalation of the conflict in the Tigray region. Some airways were closed by the Ethiopian and Sudanese CAAs. Other airways that were still open were very close to the conflict zone. These are frequently used by international operators on the Europe-East Africa route. In particular: UN321, UG300 and UL432. Multiple airports were targeted by rockets. Missiles were fired across the border into Eritrea, targeting HHAS/Asmara. Within Ethiopia, HABD/Bahir Dar and HAGN/Gondar were also targeted.\nSep 2018: Risk due to hidden ATC strike. Ethiopian ATC controllers went on strike, and the ECAA and Ethiopian Airlines recruited both retired and foreign controllers to pick up the slack. Ethiopia denied several times that there was in fact a strike happening at all. The strike ended Sep 7. Many were not qualified to operate in Ethiopian airspace, due to inexperience.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "North Korea",
    "alert": "The\nprimary risk\nis from debris from missile re-entries striking aircraft overflying the oceanic part of the ZKKP/Pyongyang FIR over the Sea of Japan. North Korea regularly conducts unannounced missile tests in this area. Consider rerouting to remain over the Japanese landmass or east of it.\nThere is also a risk of mistaken identity in or near the ZKKP/Pyongyang FIR boundary, as North Korea are threatening to actively shoot down reconnaissance aircraft in their airspace.\nThe US prohibits flights across all North Korean airspace, including the oceanic part of the ZKKP/Pyongyang FIR over the Sea of Japan. Several other countries have airspace warnings in place which advise caution due to the risk posed by unannounced rocket launches.\nMajor events\n:\nJuly 2023: North Korea is threatening to actively shoot down reconnaissance aircraft in their airspace. This may put civil aviation at higher risk of mistaken identity in or near the ZKKP/Pyongyang FIR boundary.\nFeb 2023: Ballistic missile fired over the UHHH/Khabarovsk FIR and then landed inside the RJJJ/Fukuoka FIR near several international airways.\nOct 2022: Ballistic missile fired directly over Japan - the first to incur on Japanese airspace since 2017.\n2017: North Korea launched two intercontinental ballistic missiles. Both of these landed in the Sea of Japan, well inside the Fukuoka Flight Information Region (Japanese airspace), and significantly, at least one did not re-enter the atmosphere intact – meaning that a debris field of missile fragments passed through the airspace, not just one complete missile.\n2015: North Korea gradually stopped notifying ICAO of missile launches, so that aircraft could avoid the launch and splashdown areas.\nRead:\nNorth Korea Missile Threat, Oct 2022 (OPSGROUP article)",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "South Sudan",
    "alert": "Following a military coup in neighbouring Sudan in April 2023, Sudan remains closed to all civilian flights, and in South Sudan, air navigation services remain suspended above FL245.\nIn South Sudan itself, following five years of civil war, a ceasefire has largely held since Sept 2018. Significant reduction in violence, but the political and security situation remains volatile. In the event of a serious deterioration, similar to those of July 2016 and Dec 2013, HJJJ/Juba airport may be closed at short notice.\nThe UK and France still advise against overflying South Sudan below FL250/260 due to the risk posed by anti-aircraft weaponry. The US published a similar warning but rescinded it in Aug 2019. Germany withdrew their warning in March 2025.\nThe\nprimary risk\nnow comes from no ATC above FL245 due to the military coup in Sudan, and poor levels of ATC provision for overflights below FL245 or for aircraft operating to HSSJ/Juba airport. In Jan 2021, ICAO published a letter warning of service disruptions and lack of qualified ATC personnel, the lack of contingencies in place, communication issues, the number of withdrawn navigation aids and above all, the lack of information being supplied to operators regarding these issues.\nMajor events:\nApril 2023: Military coup in Sudan. Sudan’s airspace now closed, South Sudan’s airspace now closed above FL245.\nApril 2019: Military coup in Sudan led to the temporary closure of South Sudan’s airspace.\nJune 2016: The South Sudanese army declared intention to shoot down aircraft without permits and/or not following proper procedures.\nRead:\nOPSGROUP article: Sudan Airspace Update, Apr 2023",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Moldova",
    "alert": "There is an ongoing active conflict in Ukraine between Russian and Ukrainian forces. Ukraine closed its entire airspace to all civil traffic in Feb 2022. Russia and Belarus have closed large sections of their own airspace near to their FIR boundaries with Ukraine. Moldova initially closed all their airspace too, but have since opened a section on their western border with the LRBB/Bucharesti FIR for flights to LUKK/Chisinau airport.\nThe\nprimary risk\nis an unintended targeting of civil aircraft by military near the Moldova-Ukraine border, including misidentification (as with MAS17, UIA752), or confusion. The\nsecondary risk\nis from spillover from the conflict such as Russian drones and missiles.\nMajor events:\nFeb 2023: The LUUU/Chisinau FIR closed temporarily following reports of Russian drones infringing its airspace. Earlier in the month, at least two missiles also transited Moldova during a major military operation in Ukraine. Spill over risks from the conflict are being frequently reported.\nRead:\nOPSGROUP article: Ukraine and Russia Update March 2022",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Belarus",
    "alert": "There is an ongoing active conflict in Ukraine between Russian and Ukrainian forces. Ukraine closed its entire airspace to all civil traffic in Feb 2022. Russia and Belarus have closed large sections of their own airspace near to their FIR boundaries with Ukraine.\nThe US and Canada have issued an outright ban barring their operators from the entire airspace of Belarus, and several other countries have issued warnings.\nThe primary risk is an unintended targeting of civil aircraft by military near the Belarus-Ukraine border, including misidentification (as with MAS17, UIA752), or confusion.\nRead:\nOPSGROUP article: Ukraine and Russia Update March 2022\nPrior to Feb 2022, several countries and aviation organisations had urged airlines and operators to avoid the airspace of Belarus, following the country’s interception of an international flight bound for Lithuania and forced to land in Minsk on May 23, 2021. The forced landing of this flight was politically motivated, and the crew were misled into believing that there was a credible security threat against the aircraft.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Eritrea",
    "alert": "HHAS/Asmara airport was targeted on 14 Nov 2020 by missiles from the Tigray TPLF, bringing Eritrea into the conflict and meaning that operations here should be avoided. See Ethiopia summary for more detail.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Egypt",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nPrior to the June 2025 conflict between Israel and Iran, there had been no airspace warnings for Egypt for some time. The most recent official airspace warning was published by Germany for the Sinai region, advising against overflights below FL260 here due to anti-aviation and ground weaponry - but this warning was withdrawn at the end of 2024. The US and UK had similar warnings in place until they were rescinded in March 2022 and Sep 2024 respectively.\nMajor events\n:\nJune 2025: EASA issues CZIB warning of spillover risk in the airspace of Egypt and Saudi Arabia from the conflict between Israel and Iran.\nOct 2023: UK published Notams warning of increased risk over the Sinai Peninsula and the Red Sea due to the conflict in Israel/Gaza. Cruise missiles and drones launched from Yemen targeted Israel. Some shot down over the Red Sea, others landed on Egypt/Israel border.\nNew Airspace Warning: The Red Sea, Nov 2023 (OPSGROUP article)\nJuly 2019: British Airways suspends Cairo operations for one week due to security concerns.\nFeb 2017: An SA-7 anti-aircraft missile tube was found less than a mile from HECA/Cairo airport.\nOct 2015: A Russian A321 was brought down over the Sinai peninsula by a bomb loaded at HESH/Sharm El Sheikh. The group claimed the IED was placed aboard the aircraft prior to departing HESH, raising concerns of potential insider threats at the airport.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "United Arab Emirates",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe\nprimary risk\nis from short-notice airspace closures due to Iran/Israel airstrikes if the conflict resumes.\nThe\nsecondary risk\nis from incidental damage from Houthi drone and missile attacks on airports. However, there have been no Houthi drone or missile attacks in the UAE since the January 2022 strike on Abu Dhabi, and none since a ceasefire began in April 2022, improving the airspace risk picture. The threat could return if conflict resumes, but no countries have issued airspace warnings for the OMAE/Emirates FIR since 2022.\nMajor events\n:\nFeb 2022: At least three drones were shot down by surface-to-air missiles in UAE airspace on Feb 2. This time militants in Iraq claimed responsibility for the attack.\nJan 2022: Houthi ballistic missile targeting Abu Dhabi was destroyed on Jan 30 - the third attack in two weeks. Flights at OMAA/Abu Dhabi were briefly affected.\nRead:\nOPSGROUP article: Has The Yemen Conflict Reached The UAE? Jan 2022",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Jordan",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe\nprimary risk\nis from short-notice airspace closures due to Iran/Israel airstrikes if the conflict resumes. Jordan also has a high risk of GPS spoofing due to proximity to Israel/Lebanon. RNAV/RNP Approaches may not be available. False GPWS alerts possible.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Kuwait",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe\nprimary risk\nis from short-notice airspace closures due to Iran/Israel airstrikes if the conflict resumes.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Bahrain",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe\nprimary risk\nis from short-notice airspace closures due to Iran/Israel airstrikes if the conflict resumes.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Qatar",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe\nprimary risk\nis from short-notice airspace closures due to Iran/Israel airstrikes if the conflict resumes.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Oman",
    "alert": "25 June 2025: Ceasefire between Israel and Iran appears to be holding. All airspace in the region has reopened, though flights to and from Israel and Iran still require prior approval. However, all airspace between the two countries remains high risk from military activity or misidentification if the conflict resumes.\nSee OPSGROUP Briefing\n:\nMiddle East airspace situation – June 2025\nThe\nprimary risk\nis from short-notice airspace closures due to Iran/Israel airstrikes if the conflict resumes.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "India",
    "alert": "The\nprimary risk\nin India’s airspace in in the VIDF/Delhi FIR. The risk is from military activity by Pakistan and India in the disputed Kashmir region, which poses a potential inadvertent risk to aviation at all altitudes.\nThere was a period of intense shelling and aerial incursions from both sides from 7-10 May 2025. A ceasefire announced on May 10 appears to be holding. We continue to advise caution in the Kashmir region where air defense activity could resume with little warning if hostilities were to restart.\nFlight tracking indicates that some operators have resumed overflights of this region, although most are still avoiding the area, opting instead to reroute south via the Gulf of Oman and the UAE.\nSince the events of May 2025, the only country to have issued a new airspace warning to avoid the Kashmir area is France.\nMajor events\n:\nMay 2025: Ceasefire on May 10 following four days of conflict in Kashmir region. Most operators still avoiding the region and routing via Gulf of Oman and UAE.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Congo DRC",
    "alert": "There is ongoing fighting between a rebel group and the Rwandan military in the North Kivu province - along the border between Congo DRC and Rwanda. Only the UK and Canada have issued airspace warnings here so far. The area should be considered an active conflict zone, with risk to civilian aircraft at low level or on the ground.\nMajor events:\nJan 2025: Rebel forces have now entered Goma - the capital of North Kivu Province (Eastern DRC). Heavy gunfire is being reported in the city. They have declared that FZNA/Goma and its airspace are now closed.\nFeb 2024: A parked civilian aircraft at FZNA/Goma was damaged by at least one bomb dropped from a drone. Looks like military aircraft were being targeted.\nJan 2023: The Rwandan military shot at a fighter jet from the Congo DRC which they claimed had busted Rwandan airspace near FZNA/Goma. Reports suggest the aircraft was hit by a man portable air defence system (MANPAD) at low level - the jet landed safely but sustained heavy damage.\nRead:\nAfrica Airspace Risk, Jet Shot in Rwanda, Jan 2023 (OPSGROUP article)",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "Western Sahara",
    "alert": "In Sep 2021, there were concerns of a new conflict zone emerging in Western Sahara. The country is split down the middle - Morocco controls the west, and the region’s independence movement, the Polisario, controls the east. The Polisario declared war on Morocco.\nThe FAA warned that the Polisario likely had access to anti-aircraft weaponry which may pose an inadvertent risk to civil aircraft up to FL120. The GCCC/Canarias FIR issued a Notam warning operators to avoid using the airways over Western Sahara below FL200.\nBut since then, the intensity of the hostilities has remained fairly limited. No new warnings were issued, and the Canarias Notam was withdrawn in Nov 2021.\nFor ops over Western Sahara, note that there is a lack of continuous ATC coverage. Western Sahara does not control its own airspace - it falls within both the GCCC/Canarias and the GOOO/Dakar FIRs, which may complicate airspace management should the conflict escalate again. The FAA advise aircraft operating in the region to stay in touch with ATC and be prepared for possible airspace restrictions and reroutes.\nRead:\nOpsgroup article - Western Sahara Airspace Update, May 2021.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374019"
  },
  {
    "region": "Unknown",
    "country": "South Korea",
    "alert": "In 2024, South Korea started warning of GPS interference in the north of the country, likely originating from North Korea, advising pilots to watch out for ops to the Seoul airports of RKSS and RKSI. It’s especially important to watch out for GPS spoofing here - it’s right next to the border with North Korea and a bunch of prohibited areas which carry chart warnings that say in very clear language that you might get shot at if you inadvertently enter.\nSouth Korea previously had warnings in place due to the risk posed by unannounced North Korea missile launches and regional volatility. A US Notam on GPS interference expired on May 27, 2019.\nMajor events\n:\nMay 2024: Member report of GPS spoofing into RKSS/Seoul on approach to RWY 32R. They disabled hybrid and deselected GPS after seeing the risk reported on ATIS.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Rwanda",
    "alert": "There is ongoing fighting between a rebel group and the Rwandan military in the North Kivu province - along the border between Congo DRC and Rwanda. While there are no active airspace warnings here (the FZZA/Kinshasa and HYRY/Kigali FIRs), the area should be considered an active conflict zone, with risk to civilian aircraft at low level or on the ground.\nMajor events:\nFeb 2024: A parked civilian aircraft at FZNA/Goma was damaged by at least one bomb dropped from a drone. Looks like military aircraft were being targeted.\nJan 2023: The Rwandan military shot at a fighter jet from the Congo DRC which they claimed had busted Rwandan airspace near FZNA/Goma. Reports suggest the aircraft was hit by a man portable air defence system (MANPAD) at low level - the jet landed safely but sustained heavy damage.\nRead:\nAfrica Airspace Risk, Jet Shot in Rwanda, Jan 2023 (OPSGROUP article)",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Myanmar",
    "alert": "The security situation in Myanmar has deteriorated since the military coup in Feb 2021. There is conflict and violence across many parts of the country, involving air strikes and armed clashes.\nSeveral countries have issued airspace warnings at the lower flight levels due to the potential risk from military ops, surface-to-air fire and anti-aviation weaponry. We have also had reports of GPS jamming (and maybe spoofing) in the north of the FIR for overflights between China and Bangladesh airspace.\nMajor events\n:\nJan 2024: Armed group shot down a military helicopter in the northern state of Kachin, which borders China. They likely used a man portable air defence system (MANPAD).\nSep 2023: Several attacks by rebel groups against military targets across the country, including a makeshift drone which dropped bombs on aircraft hangars at an airbase next to VYNT/Naypyitaw airport.\nSep 2023: Reports of intermittent GPS jamming on airway N895 over the mainland in the VYYF/Yangon FIR.\nApr 2023: Myanmar’s main airport VYYY/Yangon temporarily closed following attack by resistance groups with improvised artillery rounds.\nSep 2022: A Myanmar National Airlines passenger was reportedly shot as bullets passed through the fuselage of the ATR 72 aircraft on approach to VYLK/Loikaw.\nFeb 2021: Military coup ousted the government. ATC strike at the end of Feb resulted in no ATC service provided to overflights (read more on that\nhere\n). Since then, there have been increasing strikes and mass protests by opposition activists,  as well as clashes with militia and airstrikes on areas where militia are known to be active.\nRead:\nOPSGROUP Article - Myanmar, Nov 2022",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Niger",
    "alert": "Risk elevated for Niger, due to risk of target misidentification for civil traffic. Security on the ground is still a problem. The US continues to advise against all travel there.\nNiger’s airspace and airports were temporarily closed to all flights in Aug 2023, following a military coup. The coup leaders are now operating defensively, and actively looking for signs of military intervention from neighbouring states. If this were to happen, it would likely be from ECOWAS states led by Nigeria, and also potentially with troops from Benin, Guinea Bissau, Ivory Coast, and Senegal. In this scenario, such regional escalation would highly likely trigger further airspace closures with increased shootdown risks in the wider area.\nRead:\nOSGROUP article, Aug 2023\nMajor events\n:\nJan 2024: Report of intermittent GPS spoofing in Niger, which began during climb out of DRRN/Niamey and remained until descent to DXXX/Lome in Togo to the south.\nDec 2023: Several reports of overflights being denied entry into Niger airspace at short notice. In all cases, a valid permit was in hand but was not accepted by Niger ATC while the flight was airborne. Likely due to CAA computer system errors. Overflights should carry extra fuel for potential holding.\nSep 2023: Niger’s airspace reopened for the first time since a military coup in July. But it now excludes French-registered aircraft, or those chartered by French interests due to a political dispute.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Turkey",
    "alert": "The\nprimary risk\nis misidentification by local militia who infrequently target Turkish military aircraft with MANPADS and weaponsied drones. Operations to LTAJ/Gaziantep should be carefully reviewed given its proximity to the Syrian border. Along the border with Syria and Iraq in proximity to conflict zones, there is a higher level of airborne military traffic, UAS and the risk of proximity to airstrikes.\nThe\nsecondary risk\nis from GPS jamming and spoofing. There are frequent reports from crews of GPS signal interference in Turkish airspace - with some as far away as abeam Baghdad. GPS jamming is common through the LTAA/Ankara FIR, and especially on the border between the ORBB/Baghdad and OIIX/Tehran FIRs. As of Nov 2023, GPS Spoofing is also being encountered over the Black Sea in Turkish airspace. All reports share very similar symptoms: uncommanded turns, position errors, and multiple GPWS warnings. The spoofed locations received all centre on Sevastopol, Crimean peninsula, a difference of between 120-250nm from the actual aircraft position.\nMore info:\nSpecial Briefing, OPSGROUP Members Dashboard\nMajor events\n:\nNov 2023: GPS Spoofing being encountered over the Black Sea in Turkish airspace.\nNov 2022: Shelling and a rocket strike near a town in southern Turkey, near the border with Syria. Turkey has been carrying out airstrikes on Syria and Kurdish regions of Iraq.\nMay 2021: Attempted drone attack by local militia on LTCC/Diyabakir airport in South Eastern Turkey.\nJan 2019: Turkish security forces intercepted three weaponised drones during attempted attacks against sites in southern Turkey.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Cyprus",
    "alert": "Two issues the LCCC/Nicosia FIR over Cyprus: proximity to active conflict zone in Syria, and GPS Interference.\nThe\nprimary risk\nis from the proximity to Syria: civil aircraft may be targeted in error, or caught in crossfire during ongoing air attacks involving Israel, Russia, Iran. Missiles may erroneously lock on to civil aircraft. There is a risk to civil aircraft operating on overwater airways east of Cyprus.\nThe\nsecondary risk\nis from GPS Interference. This has been ongoing since 2018. In April 2018, the Nicosia FIR began being used as a military staging for possible strikes in Syria, prompting EASA to issue a warning, and lead to avoidance of the FIR by many airlines. In Nov 2023, OPSGROUP received several reports of enroute aircraft being targeted with fake GPS signals, leading to complete nav failures. This type of GPS spoofing has not been seen before – IRS is quickly “infected” by false position. Suggested Guidance and Procedures, and original crew reports, in Briefing PDF here:\nGPS Spoofing, Nov 2023 (OPSGROUP article)\nMajor events\n:\nNov 2023 - ongoing: GPS spoofing reported across the Mediterranean region.\nSep 2018: Russian IL-20 shot down in error on FIR boundary with Cyprus (Nicosia FIR) - airline flights on UL620 within 50nm of this position.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Armenia",
    "alert": "20 Sep 2023: A ceasefire has been agreed between Armenia and Azerbaijan, following military conflict in the border zone. Cross-border waypoints have reopened, but most operators are still actively avoiding this region, and routing north via Georgian airspace (UGGG/Tbilisi FIR) instead.\nNo new foreign airspace warnings were issued for Armenia or Azerbaijan as a result of this recent flare-up in hostilities. Several foreign airspace warnings for Armenia or Azerbaijan were withdrawn at the end of the war in 2020. Following brief clashes in Sep 2022, only Canada issued a new airspace warning (for both countries) advising caution due to potential risk from anti-aviation weaponry and military ops.\nThe\nprimary risk\nis from any further large-scale ceasefire violations involving missiles or anti-aircraft weaponry, which may present a risk to overflights in the border region.\nMajor events:\nSep 2022: Clashes between Azerbaijan and Armenia temporarily closed all border waypoints.\nSep/Oct 2020: Conflict between Armenia and Azerbaijan led to large sections of closed airspace along the northern border. Azerbaijan warned of threat posed by long-range missiles which they claimed Armenia had been using to target locations throughout Azerbaijan. Germany and France issued airspace warnings of a potential risk to aviation from military operations including anti aviation weaponry.\nRead:\nArmenia and Azerbaijan Airspace Risk, September 2023 (OPSGROUP article)",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Azerbaijan",
    "alert": "20 Sep 2023: A ceasefire has been agreed between Armenia and Azerbaijan, following military conflict in the border zone. Cross-border waypoints have reopened, but most operators are still actively avoiding this region, and routing north via Georgian airspace (UGGG/Tbilisi FIR) instead.\nNo new foreign airspace warnings were issued for Armenia or Azerbaijan as a result of this recent flare-up in hostilities. Several foreign airspace warnings for Armenia or Azerbaijan were withdrawn at the end of the war in 2020. Following brief clashes in Sep 2022, only Canada issued a new airspace warning (for both countries) advising caution due to potential risk from anti-aviation weaponry and military ops.\nThe\nprimary risk\nis from any further large-scale ceasefire violations involving missiles or anti-aircraft weaponry, which may present a risk to overflights in the border region.\nMajor events:\nSep 2022: Clashes between Azerbaijan and Armenia temporarily closed all border waypoints.\nSep/Oct 2020: Conflict between Armenia and Azerbaijan led to large sections of closed airspace along the northern border. Azerbaijan warned of threat posed by long-range missiles which they claimed Armenia had been using to target locations throughout Azerbaijan. Germany and France issued airspace warnings of a potential risk to aviation from military operations including anti aviation weaponry.\nRead:\nArmenia and Azerbaijan Airspace Risk, September 2023 (OPSGROUP article)",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Venezuela",
    "alert": "In June 2023, the US FAA cancelled a four-year long ban on overflights of Venezuela below FL260. The applicable KICZ Notam expired in June, and hasn't been renewed. This essentially ends all restrictions on the enroute use of Venezuelan airspace - no other states have active airspace warnings in place for the SVZM/Maiquetia FIR. Any aircraft planning on using it though still need to consider the possibility of diversions - crew and passenger safety would be a major issue on the ground. The US Department of State maintains its highest level of travel warning for Venezuela due to a risk of crime and kidnapping.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Indonesia",
    "alert": "The security situation in Papua remains poor. While there are no active airspace warnings for Indonesian Papua or neighbouring Papua New Guinea, the region has a recent history of armed groups targeting either low flying aircraft or airports themselves. Operators should take extra security precautions, including limiting time spent on the ground.\nMajor events:\nMar 2023: An armed group opened fired at WAYB/Bilorai airport. One plane on the ground was hit and another diverted.\nFeb 2023: An aircraft was set on fire and the pilot taken hostage at Paro airfield.\nJan 2023: An armed group fired at an aircraft landing at WAJO/Oksibil airport. It went around and diverted.\nJune 2022: An armed group fired at an aircraft landing at Kenyam airfield.\nApr 2021: An armed group attacked WABL/Ilaga airport and torched a private helicopter.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Central African Republic",
    "alert": "The security situation on the ground in the Central African Republic is dire. There have been numerous attacks on civilians and peacekeeping troops in recent years. FEFF/Bangui airport is operating under UN control, and is subject to regular power outages. The US and UK advise against all travel to the entire country due to violent crime, civil unrest, and the presence of armed groups who control large areas of the country. There are no official airspace warnings in place for the CAR, but the general advice is to avoid landings here completely.\nMajor events\n:\nNov 2022: An unidentified aircraft dropped bombs targeting a militant group 150nm north of the capital Bangui. The group responded with small arms fire. Low flying aircraft in the area may be at increased risk.\nFeb 2021: Deteriorating security situation. A state of emergency was declared due to post election violence. The government suspended use of all airspace by foreign governments and NGOs. For the second time, armed rebels attempted to enter the capital Bangui to overthrow the newly elected president. They got within six miles of the city before being pushed back by local and UN forces.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Japan",
    "alert": "The\nprimary risk\nis from debris from missile re-entries striking aircraft overflying the oceanic part of the ZKKP/Pyongyang FIR over the Sea of Japan. North Korea regularly conducts unannounced missile tests in this area. Consider rerouting to remain over the Japanese landmass or east of it.\nThe US prohibits flights across all North Korean airspace, including the oceanic part of the ZKKP/Pyongyang FIR over the Sea of Japan. Several other countries have airspace warnings in place which advise caution due to the risk posed by unannounced rocket launches.\nMajor events\n:\nOct 2022: North Korea fired a ballistic missile directly over Japan - the first to incur on Japanese airspace since 2017.\n2017: North Korea launched two intercontinental ballistic missiles. Both of these landed in the Sea of Japan, well inside the Fukuoka Flight Information Region (Japanese airspace), and significantly, at least one did not re-enter the atmosphere intact – meaning that a debris field of missile fragments passed through the airspace, not just one complete missile.\n2015: North Korea gradually stopped notifying ICAO of missile launches, so that aircraft could avoid the launch and splashdown areas.\nRead:\nNorth Korea Missile Threat, Oct 2022 (OPSGROUP article)",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Albania",
    "alert": "Pilots should exercise extreme caution while operating in Albanian airspace (the LAAA/Tirana FIR) due to a heightened risk of degraded ATC services.\nIn April 2021, Albanian airspace (the LAAA/Tirana FIR) along with LATI/Tirana Airport was forced to close, after a number of local air traffic controllers declared themselves temporarily unfit to work.\nLocal air traffic controllers are working under significant duress and high stress, having been threatened with dismissal (or worse - being arrested and jailed) if they do not declare themselves fit for duty. A number of foreign controllers were temporarily brought in despite not being trained or rated on any of the local positions.\nSeveral international associations have published warnings, including IFALPA and IFATCA.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Chad",
    "alert": "Chad in the past was a popular fuel stop in central Africa, but multiple travel warnings now advise against travel here (see the UK advice\nhere\n, and the US advice\nhere\n). No official airspace warnings have been issued for Chad, but danger remains high. FTTJ/Ndjamena airport was closed for 2 days in April 2021 due to security concerns following the death of Chad’s long term President - more info\nhere.\nHigh threat for terrorism. Avoid landings.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  },
  {
    "region": "Unknown",
    "country": "Philippines",
    "alert": "There has been a high volume of crew reports of GPS Interference in the Philippines, leading to GPS/ADS-B dropouts, especially in the vicinity of RPLL/Manila.",
    "severity": "High",
    "coordinates": null,
    "radius_km": 300,
    "source": "https://safeairspace.net/summary/",
    "last_updated": "2025-06-27T16:34:03.374985"
  }
]